""" Задача №2
Написать точно такую же процедуру, но в декларативном стиле """

def sort_list_declarative(nambers):
    numbers.sort(reverse=True)
    return numbers

print(f"Declarative style -> {sort_list_imperative([34, 2, -3, 16, 12, -14])}")

 